Ran Plan for dir: `terraform/kubernetes` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.cloudflare_zone.bryanwp: Read complete after 0s [id=d2287afe1d6fbddb1a27e1a5b85b0288]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # cloudflare_record.kube_cp[0] will be created
+ resource "cloudflare_record" "kube_cp" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "cp.home.bryanwp.com"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "192.168.2.110"
      + zone_id         = "d2287afe1d6fbddb1a27e1a5b85b0288"
    }

  # cloudflare_record.kube_cp[1] will be created
+ resource "cloudflare_record" "kube_cp" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "cp.home.bryanwp.com"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "192.168.2.111"
      + zone_id         = "d2287afe1d6fbddb1a27e1a5b85b0288"
    }

  # cloudflare_record.kube_cp[2] will be created
+ resource "cloudflare_record" "kube_cp" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "cp.home.bryanwp.com"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = (known after apply)
      + type            = "A"
      + value           = "192.168.2.112"
      + zone_id         = "d2287afe1d6fbddb1a27e1a5b85b0288"
    }

  # proxmox_virtual_environment_vm.kube_wk[0] will be updated in-place
~ resource "proxmox_virtual_environment_vm" "kube_wk" {
        id                      = "550"
        name                    = "wk-polaris-0"
        tags                    = [
            "k8s",
            "terraform",
            "wk",
        ]
        # (25 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.kube_wk[1] will be updated in-place
~ resource "proxmox_virtual_environment_vm" "kube_wk" {
        id                      = "551"
        name                    = "wk-polaris-1"
        tags                    = [
            "k8s",
            "terraform",
            "wk",
        ]
        # (25 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

  # proxmox_virtual_environment_vm.kube_wk[2] will be updated in-place
~ resource "proxmox_virtual_environment_vm" "kube_wk" {
        id                      = "552"
        name                    = "wk-polaris-2"
        tags                    = [
            "k8s",
            "terraform",
            "wk",
        ]
        # (25 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

Plan: 3 to add, 3 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d terraform/kubernetes`
* :put_litter_in_its_place: To **delete** this plan click [here](http://e779aff7675f:4141/lock?id=resnostyle%252Fk8s-gitops%252Fterraform%252Fkubernetes%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d terraform/kubernetes`
</details>
Plan: 3 to add, 3 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`